driver-tests/iepse/IEPQETests/TupleBasedWindow_CAP/test/TupleBasedWindow_Size2_Basic/template.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tup="TupleBasedWindow_Size2_iep">
  <soapenv:Body>
    <tup:StreamInput_3attr_MsgObj>
      <City>${city.0}</City>
      <Weather>${weather.0}</Weather>
      <Temperature>${temp.0}</Temperature>
    </tup:StreamInput_3attr_MsgObj>
  </soapenv:Body>
</soapenv:Envelope>